<template>
	<section class="contract-offer">
		<p>
			За цим Договором одна сторона Продавець з одного боку, і будь-яка особа, яка прийняла умови цього Договору публічної оферти - Покупець, з іншого боку, далі спільно названі - Сторони, уклали цей Договір публічної оферти (далі - Договір), адресований необмеженому колу офіційним публічним реченням Продавця укласти з Покупцями договір купівлі-продажу Товарів, фотографії яких розміщені у відповідному розділі Веб-сайту fireon.com.ua
		</p>
		<p>
			Продавці, які мають намір здійснювати продаж Товарів за допомогою Веб-сайту fireon.com.ua та Покупці при придбанні Товарів, зображення яких розміщені на відповідних сторінках fireon.com.ua, приймають умови цього Договору про наведене нижче.
		</p>
		<ol>
			<li>
				ЗАГАЛЬНІ ПОЛОЖЕННЯ
				<ol>
					<li>
						Договірні відносини між Продавцем та Покупцем оформляються у вигляді Договору публічної оферти. Натиснення на сторінці Веб-сайту fireon.com.ua у відповідному розділі кнопки «ЗАМОВИТИ» означає, що Покупець, незалежно від статусу (фізична особа, юридична особа, фізична особа-підприємець), згідно з чинним міжнародним та українським законодавством, взяв до виконання умови Договори публічної оферти, зазначені нижче.
					</li>
					<li>
						Договір публічної оферти є публічним, тобто відповідно до статей 633, 641 Цивільного кодексу України його умови є однаковими для всіх Покупців незалежно від статусу (фізична особа, юридична особа, фізична особа-підприємець). За повною згодою з цим Договором Покупець приймає умови та порядок оформлення замовлення, оплати та доставки товару Продавцем, відповідальності за недобросовісне Замовлення та за невиконання умов цього Договору.
					</li>
					<li>
						Цей Договір набирає чинності з моменту натискання на кнопку «ЗАМОВИТИ», яким Покупець дає згоду здійснити покупку наявного Продавця Товару та діє до моменту отримання Покупцем Товару від Продавця та повного розрахунку з ним.
					</li>
					<li>Для регулювання договірних правовідносин за Договором Сторони обирають та, у разі потреби, застосовують українське законодавство. Якщо міжнародним договором, згода на обов'язковість якого надана Верховною Радою України, встановлені інші правила, ніж ті, що встановлені українським законодавством, застосовуються правила міжнародного договору.</li>
				</ol>
			</li>
			<li>
				ТЕРМІНИ І ВИЗНАЧЕННЯ
				<ol>
					<li>
						«Договір публічної оферти» - публічний договір, зразок якого розміщено на Веб-сайті fireon.com.ua та застосування якого є обов'язковим для всіх Продавців, що містить пропозицію Продавця про придбання Товару, зображення якого розміщено на Веб-сайті fireon.com.ua, направлене невизначеному колу осіб, зокрема покупцям.
					</li>
					<li>
						"Товар" - предмет торгівлі (виріб, модель, аксесуар, комплектуючі та супутні предмети, будь-які інші предмети торгівлі), про придбання якого на Веб-сайті fireon.com.ua розміщено пропозицію продавця.
					</li>
					<li>
						«Покупець» - будь-яка дієздатна фізична, юридична особа, фізична особа-підприємець, згідно з чинним міжнародним та українським законодавством, що відвідали Веб-сайт fireon.com.ua та мають намір придбати той чи інший Товар.
					</li>
					<li>
						«Продавець» - будь-яка дієздатна фізична, юридична особа, фізична особа-підприємець, згідно з чинним міжнародним та українським законодавством, які є власниками або розповсюджувачами Товару та за допомогою Веб-сайту fireon.com.ua мають намір його продати.
					</li>
					<li>
						«Замовлення» - належним чином оформлена та розміщена на Веб-сайті fireon.com.ua заявка Покупця на покупку Товарів, що адресується продавцю.
					</li>
					<li>
						«Законодавство» - встановлені українським чи міжнародним законодавством норми регулювання договірних правовідносин за Договором.
					</li>
					<li>
						«Істотний недолік Товару» - недолік, який унеможливлює або неприпустиме використання Товару відповідно до його цільового призначення, виник з вини виробника (Продавця), після його усунення проявляється знову з незалежних від споживача причин.
					</li>
				</ol>
			</li>
			<li>
				ПРЕДМЕТ ДОГОВОРУ
				<ol>
					<li>
						Продавець зобов'язується на умовах та в порядку, визначених цим Договором продати Товар на основі Замовлення, оформленого Покупцем на відповідній сторінці Веб-сайту fireon.com.ua, а Покупець зобов'язується на умовах та в порядку, визначених цим Договором, купити Товар та сплатити за нього гроші.
					</li>
					<li>
						Продавець гарантує, що Товар не передано у заставу, не є предметом спору, не перебуває під арештом, а також на нього відсутні будь-які права третіх осіб.
					</li>
					<li>
						Продавець і Покупець підтверджують, що чинний Договір не є фіктивним або удаваним правочином або угодою, вчиненою під впливом тиску або обману.
					</li>
					<li>
						Продавець підтверджує, що має всі необхідні дозволи на провадження господарської діяльності, що регулюють сферу правовідносин, що виникають та діють у процесі виконання цього Договору, а також гарантує, що має право на виробництво та/або реалізацію товару без будь-яких обмежень, відповідно до вимогами чинного законодавства України, та зобов'язується нести відповідальність у разі порушення прав Покупця у процесі виконання цього Договору та реалізації Товару.
					</li>
				</ol>
			</li>
			<li>
				ПРАВА ТА ОБОВ'ЯЗКИ ПРОДАВЦЯ
				<ol>
					Продавець зобов'язаний:
					<li>
						виконувати умови цього Договору;
					</li>
					<li>
						виконувати замовлення Покупця у разі надходження оплати від Покупця;
					</li>
					<li>
						передати Покупцеві Товар згідно з обраним зразком на відповідній сторінці Веб-сайту fireon.com.ua, оформленим замовленням та умовами цього Договору;
					</li>
					<li>
						перевірити якісні та кількісні характеристики Товару під час його упаковки на складі.
					</li>
				</ol>
				<ol>
					<li>
						Продавець має право:
						<ol>
							<li>
								в односторонньому порядку призупинити надання послуг за цим Договором у разі порушення Покупцем умов цього Договору.
							</li>
						</ol>
					</li>
				</ol>
				<ol>
					Продавець:
					<li>

						ФІЗИЧНЕ ОБЛИЧЕ ПІДПРИЄМНИК ГОНЧАРЕНКО МИХАЙЛО КОСТЯНТИНОВИЧ:

						<br> П/р: UA673220010000026007330070151 МФО: 322001
						<br> ЄДРПОУ: 3567107499
						<br> Банк: АТ УHІBEPCAЛ БAHK

						<br> 04212, місто Київ, вул. Лук'яненка Левка, будинок 12, квартира 75, ІПН 3567107499, Є платником єдиного податку -2 група

					</li>
				</ol>

			</li>
			<li>
				ПРАВА ТА ОБОВ'ЯЗКИ ПОКУПЦЯ
				<ol>
					Покупець зобов'язаний:
					<li>
						ознайомитись з інформацією про Товар, розміщену на Веб-сайті http:/fireon.com.ua/;
					</li>
					<li>
						своєчасно оплатити та отримати замовлення на умовах цього Договору;
					</li>
					<li>
						при отриманні Товару в особи, яка здійснила його доставку, переконатися у цілісності та комплектності Товару шляхом огляду вмісту упаковки. У разі пошкодження або неповної комплектації Товару - зафіксувати їх в акті, який разом із Покупцем має підписати особу, яка здійснила його доставку Покупцю.
					</li>
				</ol>
				<ol>
					Покупець має право:
					<li>
						оформити замовлення на відповідній сторінці сайту fireon.com.ua;
					</li>
					<li>
						вимагати від продавця виконання умов цього Договору;
					</li>
				</ol>
			</li>
			<li>
				ПОРЯДОК ОФОРМЛЕННЯ ЗАМОВЛЕННЯ
				<ol>
					<li>
						Покупець самостійно оформляє замовлення на відповідній сторінці Веб-сайту fireon.com.ua шляхом додавання Товарів у віртуальний кошик за допомогою натискання кнопки «В кошик!», або зробивши замовлення електронною поштою, або за номером телефону, вказаним у розділі контактів Веб-сайту fireon.com.ua.
					</li>
					<li>
						Термін формування Замовлення до 2 робочих днів із моменту його оформлення. У разі, якщо замовлення надіслано у вихідний або святковий день, термін формування починається з першого після вихідного робочого дня.
					</li>
				</ol>
			</li>
			<li>
				ЦІНА ДОГОВОРУ І ПОРЯДОК ОПЛАТИ
				<ol>
					<li>
						Ціна кожного окремого Товару визначається Продавцем та вказується на відповідній сторінці Веб-сайту fireon.com.ua. Ціна Договору визначається шляхом складання цін усіх вибраних Товарів поміщених у віртуальний кошик та ціни доставки, що визначається залежно від способу доставки відповідно до умов розділу 8 цього Договору.
					</li>
					<li>
						Вартість Замовлення може змінюватись в залежності від ціни, кількості або номенклатури товару.
					</li>
					<li>
						Покупець може сплатити замовлення такими способами:
						<ol>
							<li>
								за допомогою банківського переказу грошей на поточний рахунок Продавця, зазначеного у рахунку, в т.ч. за допомогою Інтернет-банкінгу (Покупець оплачує замовлення протягом трьох днів з дати одержання рахунку у розмірі 100% передоплати).
							</li>
							<li>
								післяплатою при отриманні Замовлення в представництві служби доставки на території України або на території іншої країни відповідно до місця здійснення замовлення товару.
							</li>
							<li>
								будь-яким іншим способом за домовленістю із Продавцем.
							</li>
						</ol>
					</li>
				</ol>
			</li>
			<li>
				УМОВИ ДОСТАВКИ ТОВАРУ
				<ol>
					<li>
						Покупець отримує Товар за допомогою доставки або отримує його особисто. Порядок оплати та отримання наведено на відповідній сторінці Веб-сайту fireon.com.ua.
					</li>
					<li>
						При доставці Товарів до інших міст України або на території іншої країни, що виконується іншими Службами доставки (далі Компаніями-перевізниками) Покупець у повному обсязі та беззастережно погоджується з Правилами перевезення вантажів цими компаніями-перевізниками.
					</li>
					<li>
						Факт отримання Товару та відсутність претензій до якості Товару, що доставляється Компаніями-перевізниками, Покупець підтверджує власним підписом у товарно-транспортній накладній, декларації Компанії-перевізника або у видатковій накладній при отриманні Товару. Зі свого боку, Продавець гарантує відвантаження Товару Компанії-перевізнику у кількості, зазначеній та оплаченій Покупцем, у комплектності згідно специфікації цього Товару та у належному (робочому) стані та якості.
					</li>
					<li>
						У разі відсутності Покупця за адресою доставки, вказаною Покупцем у заявці або відмови Покупця від отримання Товару з необґрунтованих причин, при доставці Кур'єром компанії-перевізника Товар повертається в торговий центр відвантаження. Оплата за послуги Компанії-перевізника віднімається із суми, перерахованої Покупцем за Товар. Залишок суми повертається Покупцеві на підставі його листа, надісланого на e-mail: info@fireon.com.ua із зазначенням розрахункового рахунку, на який мають бути повернені кошти.
					</li>
					<li>
						Усі питання, що виникли в процесі оплати та отримання Товару, Покупець може з'ясувати за контактними даними у розділі Контакти.
					</li>
				</ol>
			</li>
			<li>
				УМОВИ ПОВЕРНЕННЯ ТОВАРУ
				<ol>
					<li>
						Відповідно до ст. 9 Закону України «Про захист прав споживачів», Покупець має право на обмін Товару належної якості протягом чотирнадцяти днів, за винятком дня покупки, якщо більш тривалий термін не оголошений Продавцем. Покупець має право на обмін Товару з урахуванням положень законодавства про підстави та перелік Товарів, які не підлягають обміну (поверненню).
					</li>
					<li>
						Якщо Покупець має намір повернути Товар, таке повернення здійснюється відповідно до розділу Сайту «Повернення» з урахуванням правил та умов перевізника або кур'єра, що діють на території України або на території іншої країни відповідно до місця здійснення Товару.
					</li>
					<li>
						У разі наявності хоча б одного з перерахованих недоліків, Покупець зобов'язаний зафіксувати їх у складеному акті довільної форми. Акт повинен бути підписаний Покупцем та особою, яка здійснила доставку Товару або Продавцем. За можливості недоліки повинні бути зафіксовані засобами фото-або відеозйомки. Протягом 1 (одного) дня Покупець зобов'язаний повідомити менеджера (представника Продавця відповідального за оформлення замовлення на Товар) про виявлені недоліки та домовитись про заміну Товару, заповнивши при цьому рекламаційну форму на повернення Товару на сайті fireon.com.ua.
					</li>
					<li>
						Сторони погодили, що у разі недотримання обов'язкових вимог зазначеної процедури визнається отримання Покупцем Товару у належному стані - без будь-яких механічних пошкоджень та у повній комплектності.
					</li>
				</ol>
			</li>
			<li>
				ВІДПОВІДАЛЬНІСТЬ СТОРІН І РОЗВ'ЯЗАННЯ СПОРІВ
				<ol>
					<li>
						Сторони несуть відповідальність за невиконання або неналежне виконання умов цього Договору у порядку, передбаченому цим Договором та чинним міжнародним та українським законодавством.
					</li>
					<li>
						У разі виникнення спорів, пов'язаних із виконанням Сторонами цього Договору, за винятком спорів про стягнення заборгованості з Покупця, Сторони зобов'язуються вирішувати їх шляхом переговорів із дотриманням претензійного порядку. Термін розгляду претензії – 7 (сім) календарних днів з дати її отримання. По суперечках у зв'язку із стягненням заборгованості з Покупця дотримання претензійного порядку не вимагається.
					</li>
					<li>
						Усі суперечки, розбіжності або вимоги, що виникають з цього Договору або у зв'язку з ним, у тому числі стосовно його виконання, порушення, припинення або недійсності, підлягають вирішенню у відповідному суді згідно з міжнародним та українським матеріальним та процесуальним правом.
					</li>
				</ol>
			</li>
			<li>
				ФОРС-МАЖОРНІ ОБСТАВИНИ
				<ol>
					<li>
						Сторони не несуть відповідальності за невиконання будь-якого зі своїх зобов'язань, за винятком зобов'язань з оплати, якщо доведуть, що таке невиконання було викликане форс-мажорними обставинами, тобто подіями або обставинами, які справді перебувають поза контролем такої сторони, що настали після укладення цього Договору, носять непередбачуваний і невідворотний характер.
					
						<br>
						До форс-мажорних обставин відносяться, зокрема, природні катаклізми, страйки, пожежі, повені, вибухи, зледеніння, війни (як оголошені, так і неоголошені), заколоти, загибель товару, затримки перевізників, спричинені аваріями або несприятливими погодними умовами випадковості на море, ембарго, катастрофи, обмеження, що накладаються державними органами (включаючи розподіли, пріоритети, офіційні вимоги, квоти та ціновий контроль), якщо ці обставини безпосередньо вплинули на виконання цього Договору.
					</li>
					<li>
						Сторона, для якої стало неможливим виконання зобов'язань за цим Договором через настання форс-мажорних обставин, повинна негайно інформувати іншу Сторону письмово про виникнення вищезгаданих обставин, а також протягом 30 (тридцяти) календарних днів надати іншій Стороні підтвердження форс- обставин. Таким підтвердженням буде довідка, сертифікат або інший відповідний документ, виданий уповноваженим державним органом, розташованим за місцем виникнення форс-мажорних обставин.
					</li>
					<li>
						Час, який вимагається Сторонам для виконання своїх зобов'язань за цим Договором, буде продовжено на будь-який термін, протягом якого було відкладено виконання через перелічені обставини.
					</li>
					<li>
						Якщо через дії обставин непереборної сили невиконання зобов'язань за цим Договором триває більше трьох місяців, кожна Сторона має право розірвати цей Договір в односторонньому порядку, письмово повідомивши про це іншу сторону.
						<br> Незважаючи на настання форс-мажору, перед припиненням цього Договору внаслідок форс-мажорних обставин Сторони здійснюють остаточні взаєморозрахунки.

					</li>
				</ol>
			</li>
			<li>
				ІНШІ УМОВИ ДОГОВОРУ
				<ol>
					<li>
						Інформація, що надається Покупцем, є конфіденційною. Інформація про Покупця використовується виключно для виконання його Замовлення (надсилання повідомлення продавцеві про замовлення Товару, відправлення рекламних повідомлень тощо).
					</li>
					<li>
						Власним акцептуванням Договору або реєстрацією на Веб-сайті fireon.com.ua (заповнення реєстраційної анкети) Покупець добровільно дає згоду на збір та обробку своїх персональних даних з метою: дані, які стають відомими, будуть використовуватися в комерційних цілях, у тому числі для обробки замовлень на придбання товарів, отримання інформації про замовлення, розсилки телекомунікаційними засобами зв'язку (електронною поштою, мобільним зв'язком) рекламних та спеціальних пропозицій, інформації про акції, розіграші або будь-яку іншу інформацію про діяльність Веб-сайту fireon.com.ua.
						<br>Для цілей, передбачених цим пунктом, Покупцеві мають право надсилатися листи, повідомлення та матеріали на поштову адресу, e-mail Покупця, а також надсилати SMS-повідомлення, здійснювати дзвінки на вказаний в анкеті телефонний номер.
					</li>
					<li>
						Покупець дає право здійснювати обробку його персональних даних, у тому числі: поміщати персональні дані до баз даних (без додаткового повідомлення про це), здійснювати довічне зберігання даних, їх накопичення, оновлення, зміну (при необхідності). Продавець зобов'язується забезпечити захист даних від несанкціонованого доступу третіх осіб, не розповсюджувати та не передавати дані будь-якій третій стороні (крім передачі даних пов'язаним особам, комерційним партнерам, особам, уповноваженим Продавцем на здійснення безпосередньої обробки даних для зазначених цілей, а також на обов'язковий запит компетентного державного органу).
					</li>
					<li>
						У разі небажання отримувати розсилку, Покупець має право звернутися до Продавця, написавши заяву про відмову від отримання рекламних матеріалів, надіславши його на поштову чи електронну адресу.
					</li>
					<li>
						Продавець не несе відповідальності за зміст та достовірність інформації, що надається Покупцем під час оформлення замовлення. Покупець відповідає за достовірність зазначеної при оформленні замовлення інформації.
					</li>
				</ol>
			</li>
		</ol>
	</section>
</template>


<style lang="scss" scoped>
.contract-offer {
	p {
		line-height: 1.8;
	}
	ol {
		counter-reset: item;
		list-style-type: none;
		margin: 0.5rem 0;

		li {
			counter-increment: item;
			line-height: 1.8;
			margin: 2rem 0;
			&::before { 
				content: counters(item, '.') ' - '; 
			}
			ol {
				li {
					margin: 1rem 0;
				}
			}
		}
	}
}
</style>