<template>
	<section class="privacy-policy">
		<p>

			Інтернет-магазин fireon.com.ua приділяє велику увагу захисту персональних даних своїх користувачів. Користувачі інтернет-магазину  можуть переглядати сторінки сайту не повідомляючи про себе жодних персональних даних. Однак, для надання послуг, пов'язаних з купівлею товарів, представлених у нашому інтернет-магазині, нам потрібні Ваші контактні дані для того, щоб ми могли зв'язатися з Вами, підтвердити замовлення та доставити Вам замовлений товар. Ваші персональні дані ми не передаємо третім особам та захищаємо їх конфіденційність. 
		</p>

		<ol>
			<li>
				Загальні положення
				<ol>
					<li>
						
							Дана політика конфіденційності встановлює порядок отримання, зберігання, обробки, використання та розкриття персональних даних Користувача. Персональні дані Користувача ми отримуємо від Користувача при оформленні замовлення через кошик магазину, при оформленні замовлення за телефонами, які вказані на сайті, та при реєстрації самим Користувачем (створення Особистого кабінету). Персональні дані Користувача заповнюються Користувачем (при оформленні замовлення через кошик магазину або під час реєстрації на сайті). Обов'язкова для надання послуги інформація позначена спеціальним чином. Інша інформація надається Користувачем на його розсуд.
						
					</li>
					<li>
						
							Конфіденційність персональних даних - обов'язкова умова для дотримання магазином доступу до персональних даних Користувача, з вимогою не допускати їх поширення без згоди Користувача або наявності іншої законної підстави.
						
					</li>
					<li>
						
							Використання Користувачем сайту інтернет-магазину fireon.com.ua означає згоду з цією Політикою конфіденційності та умовами обробки персональних даних Користувача.
						
					</li>
					<li>
						
							У разі незгоди з умовами Політики Користувач повинен припинити використання сайту інтернет-магазину fireon.com.ua.
						
					</li>
					<li>
						
							Ця Політика застосовується лише до сайту інтернет-магазину fireon.com.ua. Інтернет-магазин fireon.com.ua не контролює і не несе відповідальності за сайти третіх осіб, на які Користувач може перейти за посиланнями, доступними на сайті інтернет-магазину fireon.com.ua.
						
					</li>
					<li>
						
							Адміністрація сайту не перевіряє достовірність персональних даних, що надаються Користувачем сайту Інтернет-магазину.
						
					</li>
				</ol>
			</li>
			<li>
				
					Персональні дані
				
				<ol>
					<li>
						
							Інтернет-магазин fireon.com.ua збирає персональні дані, а саме: ім'я, прізвище, контактний телефон, адреси електронної пошти, адреси для доставки.
						
						
							Також, ми можемо уточнити та отримати від Вас цю інформацію по телефону.
						
					</li>
					<li>
						
							Інша інформація надається Користувачем на його розсуд.
						
					</li>
					<li>
						
							Інтернет-магазин fireon.com.ua не збирає IP-адреси користувачів.
						
					</li>
				</ol>
			</li>
			<li>
				
					Цілі збору та обробки персональних даних користувачів
				
				<ol>
					<li>
						
							Інтернет-магазин fireon.com.ua збирає та зберігає тільки ті персональні дані, які необхідні для надання послуг з продажу та доставки замовлених Вами товарів.
						
					</li>
					<li>
						
							Інтернет-магазин fireon.com.ua збирає дані для зв'язку з Користувачем, в тому числі подання відповідного повідомлення про надання послуги, інформування Користувача про наявність товару, підтвердження замовлення, доставки замовлених Користувачем товарів, для зв'язку кур'єрської служби з Користувачем, а також для обробки запитів та заявок від Користувача.
						
					</li>
					<li>
						
							Обробка персональних даних Користувача здійснюється без обмеження на строк, будь-яким законним способом.
						
					</li>
				</ol>
			</li>
			<li>
				
					Умови надання доступу до бази даних
				
				<ol>
					<li>
						
							Ми не передаємо персональні дані Користувача третім особам крім випадків визначених законодавством України.
						
					</li>
					<li>
						
							Розкриття персональних даних Користувача проводиться за замовленням Користувачем товарів в інтернет-магазині fireon.com.ua. Користувач погоджується з тим, що інтернет-магазин fireon.com.ua має права передавати персональні дані кур'єрським службам, організаціям поштової зв'язку, операторам електрозв'язку, виключно з метою виконання замовлення Користувача, оформленого на сайті інтернет-магазину fireon.com.ua, включаючи доставку Товару.
						
					</li>
					<li>
						
							При втраті або розголошенні персональних даних інтернет-магазин fireon.com.ua інформує Користувача про втрату або розголошення персональних даних.
						
					</li>
					<li>
						
							Інтернет-магазин fireon.com.ua приймає необхідні організаційні та технічні заходи для захисту персональної інформації
						
					</li>
				</ol>
			</li>
			<li>
				
					Зміна Політики конфіденційності
				
				<ol>
					<li>
						
							Ми маємо право змінити умови Політики конфіденційності. У такому випадку ми замінимо версію документа на сторінці "Політика конфіденційності". Пожалуйста, періодично переглядайте ці умови, щоб бути поінформованими про те, як інтернет-магазин fireon.com.ua захищає персональні дані своїх користувачів.
						
					</li>
				</ol>
			</li>
			<li>
				
					Зворотній зв'язок. Питання та пропозиції
				
				<ol>
					<li>
						
							Всі пропозиції або питання поп приводу цієї Політики слід повідомляти у службу підтримки користувачів інтернет-магазину fireon.com.ua за електронною адресою info@fireon.com.ua
						
					</li>
				</ol>
			</li>
		</ol>
	</section>
</template>

<style lang="scss" scoped>
.privacy-policy {
	p {
		line-height: 1.8;
	}
	ol {
		counter-reset: item;
		list-style-type: none;
		margin: 0.5rem 0;

		li {
			counter-increment: item;
			line-height: 1.8;
			margin: 2rem 0;
			&::before { 
				content: counters(item, '.') ' - '; 
			}
			ol {
				li {
					margin: 1rem 0;
				}
			}
		}
	}
}
</style>